In [2]:
import pandas as pd
import numpy as np

In [3]:
ufo = pd.read_csv('ufo.csv')

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo.shape

(18241, 5)

In [7]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
City               18216 non-null object
Colors Reported    2882 non-null object
Shape Reported     15597 non-null object
State              18241 non-null object
Time               18241 non-null object
dtypes: object(5)
memory usage: 712.6+ KB

In [9]:
ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [14]:
ufo.values

array([['Ithaca', nan, 'TRIANGLE', 'NY', '6/1/1930 22:00'],
       ['Willingboro', nan, 'OTHER', 'NJ', '6/30/1930 20:00'],
       ['Holyoke', nan, 'OVAL', 'CO', '2/15/1931 14:00'],
       ...,
       ['Eagle River', nan, nan, 'WI', '12/31/2000 23:45'],
       ['Eagle River', 'RED', 'LIGHT', 'WI', '12/31/2000 23:45'],
       ['Ybor', nan, 'OVAL', 'FL', '12/31/2000 23:59']], dtype=object)

# droping

In [17]:
ufo.drop('Colors Reported',axis=1).head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [21]:
ufo.drop(["Colors Reported", 'Shape Reported'],axis='columns').head()

                   City State             Time
0                Ithaca    NY   6/1/1930 22:00
1           Willingboro    NJ  6/30/1930 20:00
2               Holyoke    CO  2/15/1931 14:00
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00

# Indexing, Selection, and Filtering

##### for series

In [69]:
col = ufo["City"].head(8)
col

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
5             Valley City
6             Crater Lake
7                    Alma
Name: City, dtype: object

In [70]:
type(col)

pandas.core.series.Series

In [71]:
col[0]

'Ithaca'

In [72]:
col[0:3]

0         Ithaca
1    Willingboro
2        Holyoke
Name: City, dtype: object

In [73]:
col[[0,4]]

0                  Ithaca
4    New York Worlds Fair
Name: City, dtype: object

In [74]:
col.index = ['a','b','c','d','e','f','g','h']

In [75]:
col

a                  Ithaca
b             Willingboro
c                 Holyoke
d                 Abilene
e    New York Worlds Fair
f             Valley City
g             Crater Lake
h                    Alma
Name: City, dtype: object

In [76]:
col['a']

'Ithaca'

In [77]:
col['a':'d']

a         Ithaca
b    Willingboro
c        Holyoke
d        Abilene
Name: City, dtype: object

In [78]:
col[['a', 'h']]

a    Ithaca
h      Alma
Name: City, dtype: object

dataframes

In [79]:
ufo["City"].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [80]:
ufo[['City','Shape Reported']].head()

                   City Shape Reported
0                Ithaca       TRIANGLE
1           Willingboro          OTHER
2               Holyoke           OVAL
3               Abilene           DISK
4  New York Worlds Fair          LIGHT

In [82]:
ufo[:2]  #rows

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [85]:
ufo[ufo["City"] == 'Willingboro']

             City Colors Reported Shape Reported State             Time
1     Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
6499  Willingboro             NaN            NaN    NJ  1/15/1991 22:00

In [86]:
ufo[ufo["City"]=="New York"]

           City Colors Reported Shape Reported State              Time
2669   New York             NaN           DISK    NY   6/30/1974 18:30
8221   New York            BLUE       TRIANGLE    NY   6/10/1995 23:00
10347  New York             NaN          OTHER    NY   6/10/1997 12:00
14668  New York             NaN          LIGHT    NY   9/24/1999 19:30
15185  New York             NaN        VARIOUS    NY  11/16/1999 18:55

# Selection with loc and iloc

In [93]:
ufo.head(10)

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

In [95]:
ufo.iloc[0:3,2]  #iloc =integers

0    TRIANGLE
1       OTHER
2        OVAL
Name: Shape Reported, dtype: object

In [96]:
ufo.loc[0:3,"Colors Reported"]

0    NaN
1    NaN
2    NaN
3    NaN
Name: Colors Reported, dtype: object

In [99]:
#df.at[label_i, label_j] Select a single scalar value by row and column label
ufo.at[1,"City"]

'Willingboro'

In [100]:
ufo.at[6,"Shape Reported"]

'CIRCLE'

In [102]:
data = pd.DataFrame(np.arange(12).reshape(3,4))
data

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [105]:
data.iat[1,2]

6

In [103]:
#df.iat[i, j] Select a single scalar value by row and column position (integers)
data.iat[1,2]

'OTHER'